Autodesk.Revit.DB.Floor.GetSpanDirectionSymbolIds
Retrieves span direction symbol ElementIds.
Returns: A collection of Element Ids of span direction symbol elements
Remarks: The element types of the Ids of these symbols
determine if the floor has one way or two way span direction graphics.
Since: 2013

Autodesk.Revit.DB.Floor.GetNormalAtVerticalProjectionPoint(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.FloorFace)
Return a surface normal on either the top or bottom face of a floor slab at a point corresponding to the vertical
projection of an arbitrary point in project space.
modelLocation:  A point in project coordinates whose vertical projection will determine the location at which
the normal will be taken.
floorFace:  A flag determining whether the top or bottom face of the floor should be used.
Returns:  Normal vector on the slab at the projection point.
Remarks:  If the floor is shape edited, the floor location at which we attempt to take the normal must be within the boundaries
of a face on the slab. Otherwise the method will return null.

Autodesk.Revit.DB.Floor.GetVerticalProjectionPoint(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.FloorFace)
Return a surface point on either the top or bottom face of a floor slab corresponding to the vertical projection
of an arbitrary point in project space.
modelLocation:  A point in project coordinates that will be projected to the slab top or bottom face.
floorFace:  A flag determining whether the top or bottom face of the floor should be used.
Returns:  Slab surface point for the vertically projected model point.
Remarks:  If the floor is shape edited, the surface location must be within the boundaries of a face on the slab.
Otherwise the method will return null.

Autodesk.Revit.DB.Floor.SlabShapeEditor
Get the SlabShapeEditor used for slab shape editing.
Remarks: Only flat and horizontal floor is valid for slab shape edit. Otherwise, ShapeEditor will be null.

Autodesk.Revit.DB.Floor.SpanDirectionAngle
Retrieve the span direction angle of the floor
Remarks: The angle returned is in radians. An exception will be thrown if the floor
is non structural.

Autodesk.Revit.DB.Floor.FloorType
Retrieves/set an object that represents the type of the floor.
Remarks: The floor type can be used to access the multi layered structure of a floor.

Autodesk.Revit.DB.Floor
An object that represents a Floor within the Autodesk Revit project.
Remarks: This object derived from the Element base object and such supports all the
methods of that object such as the ability to retrieve the parameters of that object.